{
    "title": "2023 MTG Arena Premier Play",
    "author": "Wizards of the Coast",
    "category": "MTG Arena",
    "date": "Feb 7, 2023",
    "content": "2023 is the first full year of our updated MTG Arena Premier Play in action. When we set out with our updated Premier Play system last year, our hopes were to give all Magic players an opportunity to play Magic at the highest level and to give MTG Arena players a spotlight on the biggest stages of Magic. So far, we have been excited and inspired by MTG Arena Premier Play. We will continue to work toward these goals as we grow our competitive paths.Back in April of last year, we announced MTG Arena Premier Play in 2022, which brought new events called Qualifier Play-Ins and Arena Championships (alongside our existing Qualifier Weekends and Arena Opens) to a path that looks like this:Throughout 2022, we ran nine Best-of-One (Bo1) and eight Best-of-Three (Bo3) Qualifier Play-Ins (one each month from May through December, plus an extra Bo1 Play-In). We had twelve Qualifier Weekends, one each month, and we held our first Arena Championship in September, which had a total of $200,000 in prizes.To complement the Premier Play path, we also ran Arena Opens throughout the entirety of 2022 in which players could earn invitations to Qualifier Weekends and were awarded more than $2,000,000!This brings us to MTG Arena Premier Play in 2023, where we will continue to have monthly Qualifier Play-Ins and Qualifier Weekends, will be running three 32-player Arena Championships (each with $200,000 in prizing), and plan to have another ten Arena Opens. All of the Arena Opens will be Limited formats. Qualifier Play-Ins and Qualifier Weekends will continue to be a mix of Constructed and Limited formats.Bo1 and Bo3 Qualifier Play-Ins are the best entrances into Premier Play for players looking to skip the monthly ranked ladder, and they will continue to be a mix of Constructed and Limited events. Complete the win track in either event to earn that month's Qualifier Weekend token, which grants entry into that month's Qualifier Weekend.The following is the Play-In schedule for the next three months (Bo1 // Bo3):We will continue with Play-Ins throughout the rest of the year! Stay tuned for more dates and information.Immediately following the Play-Ins and in the same formats, monthly Qualifier Weekends gather Magic players from the ranked ladder, Arena Opens, and Qualifier Play-Ins to participate in a weekend-long event.Complete the win track on Day One of Qualifier Weekend to compete in Day Two, where the top prize is a seat at the corresponding Arena Championship! Like last year, if we don't fill all 32 seats of that Arena Championship this way, players with the most Day Two Qualifier Weekend wins will earn the remaining spots. Check out the previous leaderboards.Qualifier Weekends feed into each Arena Championship:These are the pinnacle of competition in MTG Arena. There will be three Arena Championships with 32 players each over the course of 2023. Players will compete for their share of a $200,000 prize pool, and each winner and runner-up of an Arena Championship will earn a seat at the Magic World Championship.Upcoming Arena Championship schedule:Throughout 2023, all Arena Opens will be Limited events (Bo1 and Bo3 Sealed on Day 1 and a two-part draft on Day 2). Arena Opens are the height of open competition in MTG Arena—show up, sign up, and sling spells to compete for the $2,000 top prize. In 2022, we awarded over 1,000 players a total of more than $2,000,000!Furthermore, earning monetary rewards during Day 2 of an Arena Open will also earn entry into the Qualifier Weekend that follows it. We will have ten Arena Opens throughout the course of 2023 for players to join, with the next few months' schedule as follows:So, there you have it for now! In short, we are continuing to build out and grow our MTG Arena Premier Play systems, and to celebrate our first full year with the updated competitive path. For the most up-to-date information, follow us here on DailyMTG or on our official socials! We hope to see you soon for fast, fun digital Magic.Learn more about the tabletop side of Premier Play.See more on the terms and conditions for Arena Opens and Premier Play."
}