{
    "title": "MTG Arena Announcements, February 6, 2023",
    "author": "Wizards of the Coast",
    "category": "MTG Arena",
    "date": "Feb 6, 2023",
    "content": "(Editor's Note: The open and close times for Midweek Magic events have been update in the events section. The time change accomodates MTG Arena's Tuesday release schedule and ensures play time is not shortened.Tomorrow, February 7, the newest Magic set arrives in MTG Arena with a flood of Phyrexians (by the way, if you're reading this on Monday, you still have time to grab preorder bundles before they disappear!).Acquaint yourself with the new set, its mechanics, features, and more by reading the Phyrexia: All Will Be One release notes. Then, get ready for lots of great events, prizes, and more to come!To celebrate the new release, we're hosting the Welcome to Phyrexia Festival that kicks off tomorrow alongside the set release, beginning with the first event, Compleatly Outmatched. Running February 7–13, this event lets you play with five preconstructed Historic Brawl decks helmed by a powerful defender or conqueror of New Phyrexia for an opportunity to claim ten borderless manga planeswalker card styles in all. Here are just a few!Fun with the new set continues after Compleatly Outmatched with an exploration of New Phyrexia in the Welcome to Phyrexia Festival of events that start on February 13. Dive deep into the spheres of the Phyrexian plane in these events:While you're taking in the breath-stealing sights of The Fair Basilica or just perambulating through The Hunter Maze, don't forget to pick up ichor card styles on your way through the Phyrexian gift shops—because every tour ends in a gift shop, even on New Phyrexia!There are five different ichor card styles you can win in each event, and with five different events, that's 25 ichor card styles in all! These include card styles for an array of the mysterious Domini, like these:We've got lots of new offerings in the MTG Arena Store coming tomorrow, too. Stop by and check out two sets of full-art lands, fun Phyrexian praetor stickers, compleated avatars, and more!Phyrexia: All Will Be One basic landsThere's still time to subscribe for personalized gameplay stats from The Brothers' War—but be sure to do so by tomorrow, Tuesday, at 12 p.m. PT (UTC-08:00) to get yours!A new set equals a new meta, and here's your chance to hone your skills with the new dynamics introduced by the cards from Phyrexia: All Will Be One and claim gold and pack prizes! Bring your Standard deck and play Best-of-Three matches to rack up wins!*Packs awarded are from Phyrexia: All Will Be One.Events (excluding Midweek Magic) open at 8 a.m. PT and close to new entries at 8 a.m. PT (UTC-08:00) on the dates shown unless otherwise noted.NOTE: Now that MTG Arena's game updates occur on Tuesdays, we've shifted Midweek Magic to start at 2 p.m. PT on Tuesdays and end on Thursdays at 2 p.m. PT (UTC-08:00) so play time isn't cut short.Midweek Magic events open on Tuesdays at 2 p.m. PT and close to new entries on Thursdays at 2 p.m. PT (UTC-08:00).All times listed are Pacific time (UTC-08:00).Qualifier Play-In events are single-day tournaments in which players compete to earn invitations to that month's Qualifier Weekend events.Qualifier Weekend events are two-day events in which eligible players compete for invitations to upcoming Arena Championship events.Qualifier Weekend Day One and Day Two events open to entries at 6 a.m. PT and close to new entries at 8 a.m. PT (UTC-08:00) each day. You must enter within this 2-hour window—late entries cannot be accommodated.The Arena Open Day 1 entry window begins at 6 a.m. PT and closes to new entries the following day at 3 a.m. PT (UTC-08:00).  Day 2 entry window is 2 hours only, from 6 a.m. PT until 8 a.m. PT (UTC-08:00).The Arena Championship is an invitation-only, two-day virtual event for players who earn invitations through Qualifier Weekend events.The February 2023 Ranked Season begins January 31 at 12:05 p.m. PT and ends on February 28 at 12 p.m. PT (UTC-08:00)Keep up with the latest MTG Arena news and announcements on:"
}