{
    "title": "MTG Arena Release Notes – Phyrexia: All Will Be One",
    "author": "Wizards of the Coast",
    "category": "MTG Arena",
    "date": "Feb 6, 2023",
    "content": "There is a single, glorious truth etched in the hearts of the faithful: all will be one. And the splendor of artificial, inorganic perfection will soon be compleat, as Phyrexia: All Will Be One arrives on MTG Arena.Join us in rapturous harmony! If you've admired the Phyrexian treatments showcased for tabletop play, rejoice that most of these treatments will also be available to collect in MTG Arena, either through the in-game Store or by participating in the Welcome to Phyrexia Festival events, starting with Compleatly Outmatched on February 7.Events open at 8 a.m. PT and close to new entries at 8 a.m. PT (UTC-08:00 until March 12, then UTC-07:00) on the dates shown unless otherwise noted. For a full list of upcoming events, head over to the MTG Arena events page!For more information, please refer to the main Phyrexia: All Will Be One Mechanics article.Creatures with toxic will have a badge that also indicates their toxic value—how many poison counters are given to that player when dealt combat damage—to ensure that information remains top level.It's important to remember that toxic causes an additional effect! Creatures with toxic deal combat damage and give poison counters to players, and a creature's toxic value and its power aren't necessarily connected.Give +1/+1 to creature with toxic 1? Its toxic value will (still) be 1. There are also some specificities to toxic, such as only applying to players being dealt combat damage, but you can always mouseover (or tap on mobile) the card reminder text!Corrupted is a new ability word that highlights abilities that care whether an opponent has three or more poison counters. On MTG Arena, cards with corrupted have a badge that both represents the ability word and keeps track of the necessary poison counters an opponent must have for corrupted abilities to be utilized.As your opponent gains poison counters, the badge on cards in hand and on the battlefield will update to reflect their current corrupted state, cumulating in three appropriately toxic-green poison counters.When you proliferate on MTG Arena, the game will automatically select targets based on the type of counters you have and will prompt you to confirm the selection before submitting. For example, it will automatically choose to proliferate your opponents poison counters and oil counters on permanents you control but not your poison counters.If a player or permanent has more than one kind of counter, please note in the reminder text that proliferate gives another of each kind they already have—you can't have it get just one kind of counter it already has and not the others.In addition to the card set, we want to highlight a few noteworthy changes, improvements, and bug fixes players should expect on February 7:Full patch notes will be available once maintenance is complete.Hear only harmony. See only glory. Speak only truth. Phyrexia: All Will Be One will arrive on MTG Arena February 7, 2023! Keep an eye on our status page for the latest information and updates on compleation, and tune in to our weekly MTG Arena Announcements blog for the latest updates on in-game events and offerings."
}