{
    "title": "Phyrexia: All Will Be One Comprehensive Rules Changes",
    "author": "Eliana Rabinowitz",
    "category": "Announcements",
    "date": "Feb 8, 2023",
    "content": "This is a summary of the rules changes we have planned for Magic with the release of Phyrexia: All Will Be One. The official rules are still under review at the time of this writing. When they are published, they can be found on our rules page. If there should be a discrepancy between this summary and the official rules, the official rules take precedence.This new section covers For Mirrodin!, a new triggered ability on Equipment that creates a 2/2 red Rebel creature token and attaches the Equipment to that token, arming the resistance for battle against the Phyrexians!This section defines toxic, a new static ability that gives players dealt combat damage by toxic creatures poison counters in addition to the normal results of the damage. Multiple instances of \"toxic N\" can add up, and the number of poison counters given to the player is equal to the sum of those abilities, called the \"total toxic value\" of the creature.Toxic is also added to the list of possible results of damage.If an Aura tries to enter the battlefield from anywhere other than the stack but has nothing legal to enchant, it just stays in its current zone. Now the rules clarify that if an Aura token would have nothing to enchant, it simply isn't created since it doesn't have a current zone to stay in.This addition to the Commander rules allows cards that reference your commander's characteristics to find your commander and see its current characteristics regardless of what zone your commander is in. Now Tangleweave Armor can find your (hopefully big) commander even if it is hanging out in your hand or library.Atraxa, Grand Unifier references the card type \"battle\" in its reminder text. A new section has been added to the rules for the battle card type. It has one subrule, which explains that there are currently no battles. If that should change, that section will be updated accordingly.BattleMite SphereBattle For Mirrodin! ToxicIntroduction Comprehensive Rules Changes"
}