{
    "title": "The Most-Played Cards of Phyrexia: All Will Be One in Early Access",
    "author": "Adam Styborski",
    "category": "MTG Arena",
    "date": "Feb 7, 2023",
    "content": "Happy Phyrexia: All Will Be One on MTG Arena day!We're celebrating the release of Magic's newest set on MTG Arena with a look back at the awesome details and data we know about the set from last week's Phyrexia: All Will Be One Early Access event. With hundreds of players battling in thousands of games across Standard, Sealed, and Draft—all using the latest cards from Phyrexia: All Will Be One—anyone looking to get started with the new release has their head start right here.Let's get to the numbers.One of the fastest ways to collect the newest cards on MTG Arena is by playing Limited—that is, jumping to a Draft or Sealed event and opening new packs. Whether you want to rise to Mythic ranking in the monthly ranked season or solve the puzzle that every Sealed pool of cards presents, knowing what might be a good strategy is where you start.While we're not going to draft and build your deck, we can share which colors found more success during Early Access. These are the top five colors by win rate for Draft and Sealed (with more than 100 matches played).Phyrexia: All Will Be OnePremier Draft Win RatesPhyrexia: All Will Be OnePremier Sealed Deck Win RatesSure, it's a small slice into early success but what cards did players choose most? Here's the most-picked cards in each color by drafters.Which will hold up to the test of drafting and which will be left as early experiments? You'll have to draft the set yourself to discover the answer.The first weeks of an updated Standard format are always exciting as new cards—and new strategies they offer—enter play. One day of play won't be enough to tease out the newest decks to watch, but we do know which cards made their way into Standard action first.These are the most-played Phyrexia: All Will Be One cards in Standard from Early Access.Now that you have some (preliminary) tools to match your talent, your next step might be to jump into the Standard Metagame Challenge, February 10–13, and test yourself while claiming rewards for your well-planned strategies. Or you can climb the ranked season ladder in Quick Drafts and Premier Drafts, take your new deck builds up against others in Standard or Alchemy matches, and much more on MTG Arena. See what's coming up in the MTG Arena event schedule in the weekly announcements.Don't forget to take what you've learned out to your local game store for Phyrexia: All Will Be One events, too, to get that analog experience of opening packs, finding amazing cards, and having fun tapping and casting across from someone who could be your next friend."
}