{
    "title": "The Legends of Phyrexia: All Will Be One",
    "author": "Grace Fong",
    "category": "Feature",
    "date": "Feb 2, 2023",
    "content": "All will be one! Since the fall of Mirrodin, New Phyrexia has bloomed into its own biomechanical society. As we return to this deadly plane, we will meet new characters and witness the fate of those unlucky souls who came before . . .Elesh Norn, Mother of MachinesWhen the Phyrexians invaded Mirrodin, they fell under the influence of the plane's colored suns. The mana from the white sun gave birth to Elesh Norn. She adopted and twisted the societies and beliefs of those she conquered into her Phyrexian faction, the Machine Orthodoxy. She preaches a vision of grand unity where no creature is separated from the other by such pitiful, mortal barriers as skin or flesh.At first, Norn believed she was the divine speaker for Karn, the planeswalking golem who brought Phyrexians to Mirrodin. As their creator, he was revered as a god. But he proved to be mortal, flawed, and betrayed the Phyrexian cause. This convinced Norn that she must become her people's new leader, and she dubbed herself the Mother of Machines. To shepherd in a new age of Phyrexian glory, she has orchestrated a plan to unite the Multiverse.Unctus, Grand MetatectUnctus was once a vedalken known as Kiryk. A prominent researcher and member of the governing synod, he chose to investigate a mysterious oil seeping up from Mirrodin's ground. His experiments turned into obsession, and he injected himself with the ichor. From then on, his dreams were tainted with visions of Phyrexia, and he worked to achieve its goals. He compleated himself, his fellow vedalkens, and their human Neurok rivals. From their parts, he built his greatest: the Meldweb, a living network of vedalken and Neurok brains that would serve as an all-powerful reservoir of knowledge.Vraan, Executioner ThaneMirrodin's necrogen-infested Mephidross served as a home for the plane's vampires. Of those vampires, only the most skilled assassins were granted a seat in the Bleak Coven. When the Coven's leader, Vraan, discovered the power of Phyrexianization, he and his followers welcomed it with open arms. After accepting compleation, they turned their cutthroat ways to the new social hierarchy, and Vraan murdered his way into the Seven Steel Thanes. They say he collects the heads and memories of his victims for his Crypt of Keepsakes.Geth, Thane of ContractsBefore Phyrexia invaded Mirrodin, Geth was a Moriok human who controlled his realm with armies of zombified nim. However, his thirst for power led to his demise, and his body was reduced to just his head. Determined to reclaim his power, Geth aided the Phyrexian invaders in exchange for a new, more powerful body and the title of Steel Thane. But unlike the other thanes, who prefer violent subjugation, Geth uses backhanded, binding magical contracts to enslave his subjects. The other thanes thus view him as weak and ridicule his human origins.Slobad, Iron GoblinSlobad was a goblin inventor and would-be hero who sacrificed his newfound Planeswalker spark to save the people of Mirrodin. Many thought him dead when he was trampled into the earth, but his broken body sank into the plane's core—where Phyrexia waited. Holding onto hope that he would see his friend Glissa again, Slobad reluctantly accepted as the Phyrexian oil reshaped his body. Finally mended, he emerged with the understanding that Glissa, too, had the honor of joining Phyrexia. Still influenced by the memories of his previous life, Slobad modified his Phyrexian body to resemble his late friend, the golem Bosh. Slobad now toils for the compleation of the Multiverse, convinced that Phyrexia has reunited him with his friends.Malcator, Purity OverseerJin-Gitaxias crafted Malcator from the first loxodon he captured in the Phyrexian invasion. The creature was so strong, so intelligent, so close to perfection. With a few minor adjustments, Jin-Gitaxias built the ideal candidate to lead the most powerful of his research sectives. Malcator's discerning eyes would overlook what the other sectives produced, making sure their creations passed the Standards of Purity. And those that did not would be reinvented—by any means necessary—until they, too, were perfect.Venser, Corpse PuppetWhen the artificer Venser arrived on New Phyrexia, what he saw horrified him so much that he gave up his Planeswalker spark to prevent the glistening oil from spreading throughout the rest of the Multiverse. However, his sacrifice was in vain, and Phyrexia still took over Mirrodin. Venser's soul perished alongside his spark, but Phyrexians are never ones to waste good material. The inventor's corpse was unearthed by Sheoldred's troops and woven into the fabric of a new goliath who serves Sheoldred in her war against Elesh Norn.Ria Ivor, Bane of BladeholdRia Ivor was an Auriok, one of the first Mirran inhabitants to encounter the Phyrexians. She stood on the front line of the invasion, ready to defend her homeland and live up to her title as the Champion of Bladehold. She fought them for as long as she could, but her heroism would eventually become her undoing. On a mission to rescue a besieged leonin settlement, her party was ambushed, and she gave her life to ensure the survivors could escape. Now, she has been turned into the enemy she once feared.Glissa SunslayerThe heroic elf Glissa saved Mirrodin from the destruction at the hands of Memnarch, but her adventure ended in tragedy, and she retreated underground. While she slept, Phyrexian oil seeped into the plane's core and infected her buried body. Vorinclex, Praetor of the Vicious Swarm, awakened her newly compleated form to serve as his speaker. Now she patrols the Hunter Maze as its most powerful, cold-blooded warrior, shepherding in the Grand Evolution by culling the weak until only the strong remain.Ezuri, Stalker of SpheresEzuri was an elven bandit who became a Mirran resistance leader during the Phyrexian invasion. However, his camp was attacked, and he was taken prisoner by the Progress Engine. Deep in their research labs, he was made into one of them. Now, Ezuri is a cunning, cold-hearted hunter who stalks the spheres and uses knowledge of his former allies to capture them.Atraxa, Grand UnifierOnce an angel who fought valiantly to protect Mirran survivors, Atraxa was Phyrexianized by Elesh Norn, who did so to honor her tenacity. Jin-Gitaxias, Sheoldred, and Vorinclex contributed to the process, and she was reborn as Atraxa, the symbol of a unified New Phyrexia. She now serves as Norn's most loyal general and looks forward to her part in the indoctrination of the rest of the Multiverse.Kemba, Kha EnduringKemba and her leadership helped the leonin of Mirrodin survive the Phyrexian invasion. She is the leader of the surviving leonin. Although originally reluctant to take on the revered title of \"Kha,\" she took it on to give her people a banner of hope to rally behind. Now, she serves as advisor to the Vulshok Planeswalker, Koth, and was a key voice in bringing the dissonant Mirran cultures into a strong resistance.Thrun, Breaker of SilenceThe trolls of Mirrodin stored their history and prophecy in Tel-Jilad, the sacred Tree of Tales. Tel-Jilad and the surrounding settlements were obliterated during the Phyrexian invasion, but one troll elder, Thrun, escaped with his people's knowledge intact. Now, he is the historian and storyteller of the Mirran resistance, and he pledges to protect the memories of Mirrodin and pass them from generation to generation.Jor Kadeen, First GoldwardenJor Kadeen is known amongst the Mirrans as a warrior and leader. He is intelligent and strategic, developing numerous guerilla tactics to ensure the Mirrans' survival in the face of their overpowering Phyrexian enemy. He pioneered the invention of hexgold, a substance refined from Glimmervoid plates and rare blinkmoth serum that helps protect against exposure to Phyrexianizing substances. Jor Kadeen's elite soldiers are known as the Goldwardens, and his hexgold mask and injections are symbols of his leadership.Melira, the Living CureThe human Melira was born devoid of her Sylvok people's usual metal augments. Originally shunned and ridiculed as \"the Fleshling,\" she grew into a healer and leader when she discovered her body was immune to the Phyrexian oil. Now, she has learned to defend herself and others, and she works tirelessly with the Mirran resistance, caring for its people any way she can.Skrelv, Defector MiteOnly a foot tall but equipped with a sharp bite, Skrelv and thousands of his siblings were created for a simple task, one he has long since forgotten. By all standards of the mighty Machine Orthodoxy, he is worthless and defective, and should have been harvested for parts long ago for integration with a more worthy Phyrexian. However, through some serendipitous combination of cleverness, luck, and his small stature, he has managed to evade being recycled.Karumonix, the Rat KingMirrodin was meant to be a perfect, metallic plane, but even such a shining plane could never be free of vermin. The rats that arrived here bred, and after their invasion of Phyrexia, they bred more. And more. And more, until they turned in upon themselves, devouring each other to form a greater whole. Their skeletons, flesh, and screeching voices united into one choir that called itself Karumonix. Their new, unified hive mind can now sense and manipulate their rodent brethren anywhere in New Phyrexia.Kethek, Crucible GoliathUrabrask knew he would need allies in his rebellion against Elesh Norn, and ruthless Sheoldred was the obvious choice. As a gesture of goodwill, these allies worked together to create a new Phyrexian general to lead their united front. Kethek is a merciless goliath who uses the flamethrowers built into her body to melt her enemies into slag. Then, with her many hammer-like arms, she reforges them into cannon fodder for Urabrask and Sheoldred.Migloz, Maze CrusherWhen the Phyrexians changed the surface of Mirrodin, they found themselves changing as well. Migloz participated in the construction of New Phyrexia, designed to drill holes into the plane's surface. But upon the compleation of his sphere, he found a strange ambition blossom inside him. So, he did what he did best—tunnel. He drilled through the floor of his Furnace Layer birthplace and emerged in the Hunter Maze. Fascinated by the new environment of twisting, oxidized copper, he adapted and made it his new home. Now he roams both spheres, using his massive arms to leap and swing from structure to structure.Mondrak, Glory DominusWhen Phyrexia reshaped the surface of Mirrodin, parts of the very land took on a mind of its own. Entire mountains began to move, becoming godlike Phyrexian creatures known as the Domini. Mondrak was born from the spires of the Fair Basilica. She grew dozens of mouths whose keening wail compels living things to assimilate into Phyrexia. She is an awe-inspiring but brain-melting sight.Tekuthal, Inquiry DominusWhen Phyrexia reshaped the surface of Mirrodin, parts of the very land took on a mind of its own. Entire mountains began to move, becoming godlike Phyrexian creatures known as the Domini. Tekuthal emerged from the waters of the Surgical Bay and hovers through the air with unbearable scorn. He does not speak but communicates his ridicule of lesser beings by changing his body shape to mimic and belittle them.Drivnod, Carnage DominusWhen Phyrexia reshaped the surface of Mirrodin, parts of the very land took on a mind of its own. Entire mountains began to move, becoming godlike Phyrexian creatures known as the Domini. Drivnod grew out of the skeletal, necrogen-drenched architecture of the Dross Pits. He is a grinning, spiked titan who takes pleasure in torturing lesser life forms. He impales his victims on his staff and conducts them like an orchestra in a symphony of agonized screams.Solphim, Mayhem DominusWhen Phyrexia reshaped the surface of Mirrodin, parts of the very land took on a mind of its own. Entire mountains began to move, becoming godlike Phyrexian creatures known as the Domini. Solphim was forged in the Autonomous Furnace. She is an infernal giant in a gown of spears who carves mad commands into the metallic landscape with her molten-hot appendages, always urgent and always contradicting her previous orders.Zopandrel, Hunger DominusWhen Phyrexia reshaped the surface of Mirrodin, parts of the very land took on a mind of its own. Entire mountains began to move, becoming godlike Phyrexian creatures known as the Domini. Zopandrel came from the Hunter Maze. She is a majestic, horned being with scythe-like limbs who patrols with the uncaring cruelty of an apex predator. She releases Phyrexianizing spores wherever she goes and beheads her prey before devouring them.Ovika, Enigma GoliathUnlike the Domini who emerged from the construction of the Phyrexian spheres, Ovika was born from the remains of Mirrodin after it had been ravaged for building material by the Phyrexian troops. He built his immense body from the salvage, giving himself all the eyes and limbs he would need to oversee and investigate his fascinating plane.Graaz, Unstoppable JuggernautMirrodin's levelers were giant, merciless creatures created by Memnarch to wreak terror across the plane at his behest. When he was deposed, they were left to wander the land, confused and leaderless. Although many were captured and absorbed into New Phyrexia, Graaz remains and still wanders the surface of Mirrex, tearing through everything in its path with the same ferocity as if Memnarch never left.Ixhel, Scion of AtraxaElesh Norn created Atraxa and bequeathed upon her a sacred duty. While Norn turned her conquering eye to the Multiverse, Atraxa would have the honor of bringing the other spheres of New Phyrexia into the fold. Atraxa knew if she were to do this, she would need a lieutenant of her own. Taking inspiration from Elesh Norn­, Atraxa created Ixhel in her image and commanded Ixhel to go forth and subdue the other praetors.As each realm fell, Ixhel grew more and more intelligent. Determined to honor her creators, she gathered the broken bodies of her Phyrexian foes, following in her forebears' footsteps and crafting an unlife of her own. She cobbled together the poisonous Vishgraz from pieces from multiple factions, but the limbs and bones seemed to be at war with themselves within the creature's very body. Ixhel's beautiful child was branded an abomination by the Machine Orthodoxy that raised them both.This stung Ixhel to the core. But as she has matured, so has her understanding of Phyrexia, and perhaps she has begun to call into question the doctrine that raised her.Vishgraz, the DoomhiveVishgraz is an abomination even by Phyrexian standards, a monstrosity cobbled together from the organic and inorganic components of compleated warriors from across the plane—most notably Geth, one of the Seven Steel Thanes. He was meant to be Ixhel's glorious first creation, just as Atraxa created her. Instead, his creation was labeled an act of heresy, and he was sentenced to death.Rather than destroy her creation, Ixhel chose to set Vishgraz free in the Dross Pits. He lurks there still, learning about the world into which he was brought—and taming the writhing swarm of venomous creatures that have come to follow him.Neyali, Suns' VanguardPrior to the Phyrexian invasion, Neyali lived in the Oxidda Chain as part of the Tribe of the Helm. She trained native birds to deliver messages between Vulshok tribes. One day, she found a glowing egg that seemed abandoned by its parent, so she took it to raise. But then, the Phyrexians attacked her village!Neyali and her egg were the only survivors of the massacre. She wandered the ruins of Mirrex for weeks, looking for signs of life. She told herself she had to keep going, to protect this egg that was all that remained of her home. Just when she thought she might be safe, she found herself surrounded by Phyrexian centurions. But right before she collapsed, her dedication was rewarded. Her egg cracked, birthing a phoenix that burned with the very fire of resistance.The phoenix, Otharri, burned the Phyrexian aggressors to ashes to save Neyali and lead her to Slagmaw, a Mirran resistance camp. The rebels used hexgold to craft special falconer's gloves for Neyali, giving her and her birds matching powers to pound and crush their shared enemy. Since then, her flock has vastly expanded, and phoenixes have become a symbol of hope for a restored Mirrodin.Otharri, Suns' GloryNeyali collected a mysterious egg in the Oxidda Chain. When her Vulshok village was decimated by Phyrexians, she took the egg with her. The fiery phoenix Otharri hatched during this escape, and he vowed to protect his guardian, Neyali, with his very life. He burned every Phyrexian that approached the pair on their quest to Slagmaw, the Mirran resistance camp that would become their new home.When the Mirrans saw them, they welcomed Otharri with open arms. He lent his magical fire as a tool to help the rebels forge stronger weapons, including a pair of magical, crushing falconer's gloves for Neyali. His determination and power have become a rallying symbol of hope for all Mirrans.Chiss-Goria, Forge TyrantChiss-Goria is one of the few remaining dragons from the original Mirrodin. He is so powerful that he has escaped Phyrexianization by simply destroying any that have attempted to go near him. Mirrans craft armor and weapons from the scales he sheds. Seeing him is considered a good omen that they will win the next battle.Urtet, Remnant of MemnarchUrtet was a Myr servant who collected metal for Mirrodin's first ruler, Memnarch. Even with Memnarch gone, Urtet is determined to continue his purpose and sleeplessly scavenges Mirrex for anything of value. He can always be found carrying an assortment of tools, and he often leaves collections of useful items in his wake. These valuable little troves have made him an inadvertent yet important ally to the Mirran survivors.Kinzu of the Bleak CovenThe vampire assassins that make up Vraan's Bleak Coven are silent and deadly killers who use their fangs and claws tear their victims to shreds. But Kinzu's ambition was always larger than what she could kill with her own two hands. Never satisfied by felling targets one by one, she found a way to make phyresis work to her advantage. She infects the minds and bodies of her victims with the glistening oil, turning them into murderous puppets that kill for her and perpetuate her vicious goals.Rhuk, Hexgold NabberRhuk is a goblin armorer who perfected the art of hexgold forging and created many of the best weapons that the Mirran resistance ever wielded. He knows just how rare and valuable the phyresis-preventing material is, and he is determined to never let the resistance's primary strategic advantage fall into Phyrexian hands. No matter the risk, he will arm himself to the teeth and dive into enemy territory to take back any and all stolen equipment."
}